{
    "sidenav": {
        "home": "Home",
        "projects": "Projects",
        "call-center": "Call center",
        "e-monthly": "eMonthly",
        "galt": "Galt",
        "vision-safety": "VisionSafety",
        "web-agent": "WebAgent",
        "technical-skills": "Technical skills",
        "android": "Android",
        "dot-net-core-web-api": ".NET Core Web API",
        "financial-assessments": "Financial assessments",
        "notions-of-architecture": "Notions of architecture",
        "human-skills": "Human skills",
        "autonomy": "Autonomy",
        "creativity": "Creativity",
        "knowledge-sharing": "Knowledge sharing",
        "languages": "Languages",
        "team-leading": "Team leading",
        "hobbies": "Hobbies",
        "contact": "Contact"
    },
    "wip": {
        "work-in-progress": "Work in progress"
    },
    "projects": {
        "e-monthly": {
            "title": "eMonthly",
            "subtitle": "Architecting an Angular project",
            "template": {
                "title": "Building an Angular template",
                "after-working": "After working on several ",
                "angular-projects": "Angular projects",
                "project-manager": ", my project manager suggests me to set up the skeletton of an Angular solution that would be used as a template for every new Angular app in my services centre. The template first needs to be used for a web app for Safran aeronautics company. This app, called eMonthly, helps Safran employees to input and to consult the evualuation marks for the quality of the services offered to their customers."
            },
            "architecture": {
                "title": "Integrating powerful frameworks",
                "one-week":  "I work only one week on this project. During this week, I create the Angular project, organize ",
                "architecture": "the architecture",
                "by-creating": " of the solution by creating ",
                "services": "services, components, guards",
                "references": ", etc. I add references to libraries that our centre has interest in using based on recurent feedback from clients. I especially add ",
                "angular-material": "Angular Material",
                "website": " to make rapidly and efficiently a neat website design (in particular for PoCs) and ",
                "kendo": "Kendo for Angular",
                "grid": " to be able to use grid systems that are a usual request from clients.",
                "specificities": "Once this template project is operational, I work on the specificities of the application for Safran. I note the interest of a built-in solution which is ready, modular and reusable in the future. Then I easily integrate some screens asked in the specifications using Angular Material and Kendo already configured."
            }, 
            "future": {
                "title": "Continue to improve the template",
                "expect" : "I expect to work again on the Angular project template to improve it based on the needs of the future clients. I also want to make it more accessible and modular for the future developers that will use it, even if they are new to Angular, to encourage them to use good conception practices from the beginning."
            }
        }
    }
}