{
    "sidenav": {
        "profile": {
            "name": "Antonin CHARRIER",
            "job": "Angular consultant",
            "coordinates": "View my contact informations",
            "resume": "View my resume",
            "email": "Send an email",
            "linkedin": "Visit my LinkedIn page",
            "github": "Visit my GitHub page"
        },
        "home": "Home",
        "projects": "Projects",
        "call-center": "Call center",
        "e-monthly": "eMonthly",
        "galt": "Galt",
        "vision-safety": "VisionSafety",
        "web-agent": "WebAgent",
        "technical-skills": "Technical skills",
        "android": "Android",
        "dot-net-core-web-api": ".NET Core Web API",
        "financial-assessments": "Financial assessments",
        "front-end": "Front end",
        "notions-of-architecture": "Notions of architecture",
        "human-skills": "Human skills",
        "autonomy": "Autonomy",
        "creativity": "Creativity",
        "knowledge-sharing": "Knowledge sharing",
        "languages": "Languages",
        "team-leading": "Team leading",
        "hobbies": "Hobbies",
        "career": "Career",
        "language": "Change language",
        "dark-mode": "Toggle dark mode",
        "about": "About"
    },
    "wip": {
        "work-in-progress": "Work in progress"
    },
    "home": {
        "title": "Antonin CHARRIER",
        "subtitle": "Angular consultant",
        "two-years": "After two and half years at ",
        "capgemini": "Capgemini",
        "capgemini-website": "Capgemini website",
        "experience": " during a work experience in parallel with a formation at ",
        "intech": "IN’TECH",
        "intech-website": "IN’TECH website",
        "applications": ", I built and maintained several applications for ",
        "securitas": "Securitas",
        "securitas-website": "Securitas website",
        "skills": ", improving my skills in ",
        "development": "",
        "dot-net": ".NET",
        "dot-net-bis": ", ",
        "angular": "Angular",
        "angular-bis": " and ",
        "android": "Android",
        "development-bis": " development.",
        "frameworks": "I love working on modern frameworks with ergonomists and designers to build websites with a great user experience. I’m currently working on a large web site for Securitas security agents.",
        "projects" : {
            "title": "Projects",
            "card-subtitle": "For Safran, Securitas...",
            "card-content": "I worked on several projects, mainly websites and mobile applications"
        },
        "technical-skills" : {
            "title": "Technical skills",
            "card-subtitle": "Angular, Android...",
            "card-content": "I appreciate being able to work on modern technologies, especially on front end"
        },
        "human-skills" : {
            "title": "Human skills",
            "card-subtitle": "Autonomy, creativity...",
            "card-content": "These qualities and skills help me in my daily work"
        },
        "career" : {
            "title": "Career",
            "card-subtitle": "Until today",
            "card-content": "After five years of study and two and a half years of professional experience, here is where I am"
        },
        "hobbies" : {
            "title": "Hobbies",
            "card-subtitle": "On my free time",
            "card-content": "That is what I do on my spare time, these activities are really important to me"
        }
    },
    "projects": {
        "title": "Projects",
        "subtitle": "Several projects I worked on",
        "call-center": {
            "title": "Call center",
            "subtitle": "From Angular developer to team leader",
            "card-subtitle": "Angular, PoC",
            "card-content": "Call center is the PoC of a website made in Angular for Energies E.Leclerc",
            "portal": {
                "title": "Create a portal for a call center",
                "apprenticeship": "During my apprenticeship at Capgemini, I worked on several projects of Angular websites. Among them, I took part in October 2018 to a ",
                "poc": "PoC (proof of concept)",
                "goal": " of a portal for a call center. The goal of the PoC is to be suggested to the entity Energies E. Leclerc. Indeed, Siplec, a subsidiary company of import/export belonging to E. Leclerc group, is a client of Capgemini. A Capgemini team especially works on APIs linked to electricity distribution and sale. This team also put online the website of Energies E. Leclerc, allowing customers to subscribe to an offer online. That’s why the PoC must complete this site in order to enter the phone subscriptions and ensure a post-sale service for all customers.",
                "project": "The project is ordered by a commercial from Capgemini so it can be sold thereafter to other energy providers. Indeed, in 2007, the energy market in France has opened and, since, the historical providers EDF (electricity) and GDF (natural gas), are not the only one to be able to deal their energy anymore. Since a few years, the alternative suppliers flourished, thus opening a big market for Capgemini to set up their numeric infrastructures. It is for this reason that the first objective of the PoC is the reusability in order to easily sell it to all the new energy providers."
            },
            "poorly-monitored": {
                "title": "A poorly monitored project",
                "beginning": "At the beginning, the project has many difficulties in terms of organization, communication and monitoring. We are three developers on the project, along with a project manager who has very little time to devote, being busy with other projects and the PoC being less a priority. The order comes from the commercial, who, after providing us ",
                "ux": "UX (user experience)",
                "and": " and ",
                "ui": "UI (user interface)",
                "mock-ups": " mock-ups, explains to us the functionalities to implement so he can present the project to the clients. Finally, the last people involved are the Siplec team who implements the APIs on which we rely.",
                "problem": "The problem we face is that one of the APIs is under development and the other one uses different data than we are supposed to display from the mock-ups. We raise the problem to our project manager, and we try to make the most of what we can in total ",
                "autonomy": "autonomy",
                "information": ". After several days, since we have no information from the three other parties, we decide to organize ourselves. After consultation with my two colleagues, I take the ",
                "lead": "lead",
                "experienced": " on the project, being the most experienced of the three. My goal is to ensure the ",
                "monitoring": "monitoring",
                "inexistent": " of the team, which is inexistent, to establish a ",
                "communication": "communication",
                "parties": " with other parties of the project and to improve the ",
                "organization": "organization",
                "project": " of the project."
            },
            "experience": {
                "title": "Call center",
                "initiative": "This initiative is welcomed by our project manager who lets us manage the PoC with the other interlocutors. We succeed in improving the communication between the commercial and the APIs team, the first one expressing clearly his expectations and the second one explaining the current possibilities and evolutions which are possible or not. Thus, the project can be presented functional to the client and it is at this time that my mission ends. During the following months, no longer working on the project, I was still able to help the new members by ",
                "knowledge": "sharing my knowledge",
                "project": " of the project.",
                "chaotic": "Even though the path of the project was chaotic, it will still allow me to draw a lot of experience, including human. I was able to concretely observe the impact of good and bad communication between the different interlocutors of a project and I was able to learn about project management."
            }
        },
        "e-monthly": {
            "title": "eMonthly",
            "subtitle": "Architecting an Angular project",
            "card-subtitle": "Angular, architecture",
            "card-content": "eMonthly is a website of Safran based on an Angular template I architected",
            "template": {
                "title": "Building an Angular template",
                "after-working": "After working on several ",
                "angular-projects": "Angular projects",
                "project-manager": ", my project manager suggests me to set up the skeletton of an Angular solution that would be used as a template for every new Angular app in my services centre. The template first needs to be used for a web app for Safran aeronautics company. This app, called eMonthly, helps Safran employees to input and to consult the evualuation marks for the quality of the services offered to their customers."
            },
            "architecture": {
                "title": "Integrating powerful frameworks",
                "one-week": "I work only one week on this project. During this week, I create the Angular project, organize ",
                "architecture": "the architecture",
                "by-creating": " of the solution by creating ",
                "services": "services, components, guards",
                "references": ", etc. I add references to libraries that our centre has interest in using based on recurent feedback from clients. I especially add ",
                "angular-material": "Angular Material",
                "website": " to make rapidly and efficiently a neat website design (in particular for PoCs) and ",
                "kendo": "Kendo for Angular",
                "grid": " to be able to use grid systems that are a usual request from clients.",
                "specificities": "Once this template project is operational, I work on the specificities of the application for Safran. I note the interest of a built-in solution which is ready, modular and reusable in the future. Then I easily integrate some screens asked in the specifications using Angular Material and Kendo already configured."
            }, 
            "future": {
                "title": "Continue to improve the template",
                "expect" : "I expect to work again on the Angular project template to improve it based on the needs of the future clients. I also want to make it more accessible and modular for the future developers that will use it, even if they are new to Angular, to encourage them to use good conception practices from the beginning."
            }
        },
        "galt": {
            "title": "Galt",
            "subtitle": "The packages manager that eases the life of developers",
            "card-subtitle": "Vue.js, .NET",
            "card-content": "Galt is a NuGet packages manager designed for developers",
            "for-developers": {
                "title": "A project designed for developers",
                "galt": "Galt is a packages manager allowing developers to watch and administrate the dependencies architecture of their .NET project hosted on ",
                "nuget": "NuGet",
                "nuget-website": "NuGet website",
                "platform": " platform.",
                "idea": "The idea rises in 2016 from one of my teachers in his IT company, ",
                "signature-code": "Signature Code",
                "signature-code-website": "Signature Code website",
                "tool": ". He wants to create a tool allowing his employees to easily manage all the packages used by their applications. The objective is to visualize the dependencies of a project as a tree, to be warned when new package versions are released and to be alerted in the case of a versions conflict.",
                "internship": "One of my classmates joins Signature Code in February 2016 for an internship for one month. He works on a ",
                "poc": "PoC (proof of concept)",
                "first-version": " along with other employees of the company. This first version of the project works, even though it has limited functionalities and a poor user interface. That's why our teacher decides to start a complete second version of the application. As a school project, he submits the idea to my team which is composed by my classmate who already worked on the PoC and two others classmates.",
                "logo": "Our logo",
                "start": "We start the project in October 2016. We decide to use adapted technologies for a user-friendly interface and an efficient packages management. Back end is managed by ",
                "asp": "ASP.NET MVC 5",
                "front": " and front end by ",
                "vue-js": "Vue.js",
                "framework": ", a JavaScript framework whose major version 2.0 has just been released two weeks before. In order to display dependencies graphs, we decide to use a powerful graphic framework, ",
                "d3-js": "d3.js",
                "technologies": ". These technologies offer us many possibilities. However, they are new to us, besides being recent and then not much documented."
            },
            "front-end": {
                "title": "A first approach of the front end with Vue.js",
                "in-charge": "During the project, I am mainly in charge of the front end with ",
                "vue-js": "Vue.js",
                "frameworks": ". This framework belongs to the three main JavaScript web frameworks along with ",
                "angular": "Angular",
                "google": " (Google) and ",
                "react": "React",
                "facebook": " (Facebook), unlike it is developed by an independent team. The other members of the team are being affected other tasks: one of them manages the creation and display of the dependencies graphs with d3.js, another one works on the back end and the last one makes the links between front and back end and is a technical reinforcement for the other members of the team with his experience.",
                "suggest": "I suggest to my team to build a ",
                "spa": "SPA (single page application)",
                "views": " containing the different views necessary for the application (home, sign up and sign in, search, graph, etc.). All the SPA is then sent to the back end. Our ASP.NET server displays a web page containing only a reference to our SPA in charge of the user interaction (note: it is seldom necessary to host your client app inside a server-rendered web-app but it was an easier solution for this project. Most of the time, a client app and web services are enough).",
                "mock-ups": "Before starting the SPA creation, I begin with creating detailed mock-ups of every screen from our application using Moqups tool. It is an important step, especially when building SPAs, because views are entirely modular. It is necessary to precisely define ",
                "ux": "UX (user experience) ",
                "and": " and ",
                "ui": "UI (user interface)",
                "direction": " to have a direction to follow during implementation.",
                "powerful": "I learn the architecture and the operation of a web framework with online learning and with one of my teammates who already experienced Vue.js. It is a powerful tool allowing us to create fluid and user-friendly interfaces and to display the application pages created by reusable components in order to make a completely modular app."
            }, 
            "functional-project": {
                "title": "A functional project",
                "objectives" : "After four months, we achieve the objectives established during our pre-project phase, which are:",
                "dependencies": "Display a dependencies graph for a package hosted on NuGet retrieved using a search bar.",
                "versions": "Display the different versions available for this package, the potential new versions of the dependencies and the potential conflicts of versions within the dependencies.",
                "account": "Allow the user to create an account to save the packages he consulted recently and his favourite packages.",
                "presentation": "My team presents the project during a forum of IT projects in my school in January 2017. We know that the presentation will be hard because our project aims a technical audience. Though we succeed in making it accessible for a large audience, so our jury understand the stakes of our project. Among the jury, some of the members have a technical background and ask detailed questions about the functioning of our application, especially how we handle the package dependencies. Some other ones ask for the possible evolutions and improvements on the project. These improvements are the secondary objectives we defined in the case we had still time before the forum:",
                "extend": "Extend the packages management to hosting platforms other than NuGet (npm, Maven, gradle, etc.) using interfaces in our backend.",
                "optimize": "Optimize the packages download (as some packages can need several minutes), especially by suggesting background download options.",
                "upload": "Add the possibility to upload your own package without using a hosting platform.",
                "opportunity": "This project was a great opportunity for me on the technical side as well as the human side. I discovered several very recent technologies that I used again on my other projects. I have been able to answer the need of a customer (my teacher) and to end a project in its whole (the site has been deployed on our school server). I also took part in the organization of a complex project and I improved my oral expression during the presentation at the forum in front of a jury who did not necessarily have a technical background."
            }
        },
        "vision-safety": {
            "title": "VisionSafety",
            "subtitle": "Protect the ones who protect us",
            "card-subtitle": "Xamarin, Android",
            "card-content": "VisionSafety is a life-saver application for Securitas agents",
            "save-lives": {
                "title": "An application to save lives",
                "vision-safety": "VisionSafety is an application from the Vision panel of Securitas. It is designed for security agents who work in risky sites. With it, the agent can send alerts using an easily accessible big button (with a simple click, he starts a countdown before the alert with the ability to cancel it in case of an error, and with a long click, he sends the alert directly). He also can switch to “danger” mode, thus warning that he felt a potential imminent risk. During this mode, all alerts are immediate. Some agents are equipped with ",
                "bluetooth": "Bluetooth",
                "buttons": " physical buttons that they can attach to bracelets in order to send alerts in a more discreet way using simple stealthy pressions.",
                "detection": "The application also detects the falls and extended (and therefore abnormal) inactivity and sends alerts in consequence. Finally, it allows agents to check in and out at the start and at the end of their round of surveillance and to track their GPS position. All the application is entirely configurable and modular depending on the specificities of each site to protect. Thanks to this application, Securitas gains in efficiency to intervene in case of alert and can more easily rescue and agent having, for example, an assault."
            },
            "manage": {
                "title": "Manage the application alone",
                "vision-safety": "VisionSafety is an Android app developed using ",
                "xamarin": "Xamarin",
                "environment": " environment (to code in ",
                "c-sharp": "C#",
                "create": " and to create ",
                "cross-platform": "cross-platform iOS/Android",
                "apps": " apps, although VisionSafety is obviously not intended to be developed for iPhone). We are three developers to have worked on the application. The first one set up the base and created the interface. Then I developed the entire application with my other colleague until the delivery of the first version.",
                "maintened": "Since then, the application is maintained and has been regularly improved to integrate all the current functionalities. It is now me who take cares of maintaining it in full, from the needs of the client to the delivery. Thus, I gained a lot in ",
                "autonomy": "autonomy",
                "as-well": " as well as in ",
                "customer-relationship": "customer relationship",
                "study": ". I study his requests, I bring him my ideas to best meet his needs, I develop the evolutions and finally I deliver him. Unlike other applications where my manager takes care of the contact with the customer and deliveries, he leaves me autonomous on this one and the client is fully satisfied with the quality."
            }, 
            "develop-better": {
                "title": "Develop better on Android",
                "in-addition" : "In addition to the human contributions, I also learned a lot about ",
                "android": "Android",
                "vision-safety": ". Thanks to VisionSafety, I can now to connect ",
                "bluetooth": "Bluetooth",
                "devices": " devices from an application, collect ",
                "geolocation": "geolocation",
                "data": " data from the device or even use ",
                "jobs": "jobs",
                "background": " to perform background tasks. Thanks to the UI/Library separation of Xamarin, I have better understood and respected the functioning of the ",
                "multithreading": "multithreading",
                "on-android": " on Android.",
                "enjoy": "I enjoy working on VisionSafety, it is an application whose purpose is important: protect people. In addition, it allows me to develop interesting features of Android."
            }
        },
        "web-agent": {
            "title": "WebAgent",
            "subtitle": "My biggest project on Angular",
            "card-subtitle": "Angular, .NET",
            "card-content": "WebAgent is a large website that accompanies Securitas agents in their daily job",
            "goal": {
                "title": "The goal of WebAgent",
                "vision": "During my apprenticeship, I mainly worked for the Securitas client on the Vision project. It is a set of tools that accompany the security agents in their daily work. These applications aim to help them in their tasks: plan surveillance rounds, write reports during anomalies, manage visitors on the site, etc. Among them is an ",
                "android": "Android",
                "vision-mobile": " application, VisionMobile, and a website developed in ",
                "angular": "Angular",
                "web-agent": ": WebAgent.",
                "redesign": "This site is a web redesign of a WPF heavy client. The goal is to create a modern, ergonomic and aesthetic application in collaboration with a team of designers and ergonomists. The redesign is divided in multiple batches. The first one is a reproduction of the existing from an old website that only allowed reports writing. It has been delivered to the customer in June 2019. The second and third batches concern respectively the schedules (rounds, tasks, etc.) and the ins/outs (visitors, vehicles, keys, etc.). Lastly, the last batches correspond to the management of the documents and instructions within a site as well as the training of the agents. The development is expected to last until March 2020, yet the project could be extended in the case of the integration of a wide and complex administration module that currently only exists on the heavy client."
            },
            "angular": {
                "title": "A big competence growth on Angular",
                "skills": "On this project, I was able to develop my skills in ",
                "angular": "Angular",
                "environment": ". I learned several concepts, among which:",
                "lazy-loading": "The ",
                "lazy-loading-bis": "lazy loading",
                "lazy-loading-ter": ", which allows to postpone the initialization of a module until it is requested",
                "guards": "The ",
                "guards-bis": "guards",
                "guards-ter": ", which control access to a route requested by the user",
                "resolvers": "The ",
                "resolvers-bis": "resolvers",
                "resolvers-ter": ", which allow to load the requested web page once all the necessary data of this page has been retrieved, without needing to display a placeholder or a loading spinner",
                "app-initializers": "The ",
                "app-initializers-bis": "app initializers",
                "app-initializers-ter": ", which allow to wait for data retrieval before initializing and render the website (or the module in the case of lazy loading)",
                "concepts": "Thanks to these concepts that we applied to WebAgent, it is possible to create powerful and fluid sites for the user, while avoiding a maximum of bugs on the client side. Obviously, you must know how to user them wisely in order to take the most advantage of their usefulness.",
                "team": "I had the chance to work in a team where we were constantly learning. As soon as a member discovered something interesting, he shared it and we studied whether it was possible and interesting to add it on the project. As we were efficient, we were ahead of schedule and we were able to afford a lot of micro-refactoring to have the cleanest and most efficient solution. Thanks to this enriching experience, my teammates and I now take part on other Angular projects to make ",
                "feedbacks": "feedbacks",
                "expertise": " to other teams and bring them our expertise."
            }, 
            "other-skills": {
                "title": "Some other technical and human skills",
                "web-services" : "The new site was the occasion to develop new web services on ",
                "asp-net": "ASP.NET",
                "integrate": ". We will also integrate a ",
                "signal-r": "SignalR",
                "devices": " module during the second batch to notify the application on different events (new report, new instruction, etc.).",
                "web-agent": "During the development of WebAgent, I also had the opportunity to ",
                "knowledge": "share my functional and technical knowledge",
                "welcome": " of the project. Indeed, mu team welcomed a new member after a few months of development. I was responsible for presenting him the functional specificities of the project and I was able to exchange with him on several Angular topics, knowing that he had also trained and had the occasion to discover and experiment concepts during his previous project.",
                "discover": "Finally, I could discover the ",
                "assessments": "financial assessments",
                "client": " that are sent to the client for a validation of the budget by him. It is a skill that I want to develop in order to continue to evolve within the project."
            }
        }
    },
    "technical-skills": {
        "title": "Technical skills",
        "subtitle": "My principal technical skills",
        "android": {
            "title": "Android",
            "subtitle": "Mobile is the future of digital",
            "card-subtitle": "Android, Xamarin",
            "card-content": "I gained some experience on Android on different projects",
            "discovery": {
                "title": "A step-by-step discovery as an autodidact",
                "learned": "I learned to develop on ",
                "android": "Android",
                "vision": " on the Vision project of Securitas. Inside this project gathering several applications including ",
                "web-agent": "WebAgent",
                "vision-mobile": ", is a mobile application called VisionMobile allowing to use all modules of the website from a smartphone. The security agents can write reports or register visitors in the middle of their round of surveillance without needing to come back to a computer. Since I studied Java at my school, I discovered the project and the Android world directly. I started by dealing with small returns from the client on the application in order to familiarize myself with the concepts of this new environment."
            },
            "practice": {
                "title": "A regular and thorough practice",
                "two-years": "It is now been more than two years that I’ve been working on Android, inside different projects. I continued the TPM on VisionMobile, during which I learned to create ",
                "activities": "activities",
                "and": " and ",
                "fragments": "fragments",
                "tasks": ", to use Java’s asynchronous tasks to communicate with the server. I even learned to use an ",
                "sqlite": "SQLite",
                "database": " database in order to store data in the application before sending them to the server (VisionMobile must absolutely work even without Internet connection since there are sites which have a bad network reception in some sectors). This TPM allowed me to have a general vision on the Android operation and to understand the base principles.",
                "opportunity": "I had the opportunity to work on Android in other projects. Firstly, at my school, I received during my apprenticeship introductory classes on Android. Given that I learned at my job, the classes did not teach me much, however, we had to give a project of a mobile application at the end of the cycle. I took advantage of this application to experiment and deepen my knowledge on Android, especially in terms of design, by studying in depth the operation of the different ",
                "layouts": "layouts",
                "layouts-bis": "."
            },
            "vision-safety": {
                "title": "VisionSafety particularities",
                "project": "Following this, Securitas launched the project of a new mobile application designed to ensure the safety of its agents, ",
                "vision-safety": "VisionSafety",
                "center": ". Since I work in a center mainly focused on Microsoft technologies, we decided to use ",
                "xamarin": "Xamarin",
                "one-hand": " to develop this application. The two interests are, on the one hand, to code in ",
                "c-sharp": "C#",
                "language": ", a language considered by most of the developers (including me) as way more pleasant, complete and performing than Java, and on the other hand, to be able to code ",
                "cross-platform": "cross-platform Android/iOS",
                "applications": " applications. The second interest was, in the case of VisionSafety, secondary, since the application would be deployed only on Android rugged phone and not iPhones. However, the goal of this application for the center is to serve as a showcase for customers to demonstrate our skills and offer new mobile solutions that are simple to develop using Xamarin.",
                "debuts": "Thanks to this application that I followed from its debuts, I could study the set up of the ",
                "architecture": "architecture",
                "needs": " and participate in it. Given that this application must meet quite specific needs, I was able to use particular functionalities from Android, like the fall or inactivity detection using the accelerometer, the GPS positions retrieving using the geolocation or even the connection to devices with ",
                "bluetooth": "Bluetooth",
                "ble": " (v4 and BLE).",
                "continue": "I want to continue to develop on Android and hope to have new opportunities to embark on such interesting projects of mobile applications."
            }
        },
        "dot-net-core-web-api": {
            "title": ".NET Core Web API",
            "subtitle": "This is the .NET Core Web API subtitle",
            "card-subtitle": "Angular, .NET",
            "card-content": "I mainly studied .NET during my studies and was able to put it into practice at work"
        },
        "financial-assessments": {
            "title": "Financial assessments",
            "subtitle": "This is the financial assessments subtitle",
            "card-subtitle": "Angular, .NET",
            "card-content": "During my apprenticeship, I was able to discover the financial assessments"
        },
        "front-end": {
            "title": "Front end",
            "subtitle": "Make modern, aesthetic and ergonomic applications",
            "card-subtitle": "Angular, .NET",
            "card-content": "I love working on front-end, especially in Angular and Vue.js",
            "introduction": {
                "title": "My introduction to the front end",
                "basis": "The front end is the basis of any application. This is what the user sees and what defines whether he will adopt the application or not. Through my different projects, I was able to experiment both front and back end, being mostly full stack developer. I particularly like the front end because it allows me to express my creativity.",
                "web": "Regarding the web, I appreciate using modern javascript frameworks. I first started with ",
                "vue-js": "Vue.js",
                "school": " as part of a project at my school, ",
                "galt": "Galt",
                "framework": ". This is an easy-to-understand framework that allowed me to discover this world that I did not know. In this project, I was mainly involved in front end. I learned how to create a ",
                "spa": "SPA (single page application)",
                "fluid": ", more fluid and pleasant for the user."
            },
            "angular": {
                "title": "From Vue.js to Angular",
                "capgemini": "After Galt, I joined Capgemini for an internship, then an apprenticeship. During the first year, I no longer used javascript frameworks, except for the beginning of this portfolio that I basically started with Vue.js. Finally, since 2018, the offer in ",
                "angular": "Angular",
                "projects": " has multiplied. Several web application projects have started, and it is Angular that has been chosen to develop them. Securitas, the customer for whom I have almost exclusively worked, has embarked on a \"full digital\" project for 2020, and to accompany this project, a complete migration from a heavy client to a website in Angular: ",
                "web-agent": "WebAgent",
                "integrated": ". I even later integrated other Angular projects on a temporary basis (",
                "call-center": "Call center",
                "and": " and ",
                "e-monthly": "eMonthly",
                "e-monthly-bis": ").",
                "application": "Since the Angular application was getting bigger and my company made me follow online courses on this framework, I decided to migrate the beginning of my portfolio in Vue.js to an Angular application. Thus, I was able to extend my training as an autodidact and to discover interesting tools and concepts that I and my team were able to take back on WebAgent (for example the translations via ",
                "ngx-translate": "NgxTranslate",
                "portfolio": ", which I chose after having tested Angular’s module of internationalization). This portfolio was fully developed with Angular 7. Where other people would like to use CMS to write their portfolio to simplify their work, I wanted to show my skills directly as an Angular developer."
            },
            "web-agent": {
                "title": "The front end is not only about development",
                "web-agent": "Since early 2019, I have been involved in the development of WebAgent for Securitas. It's a complex project that made me get a lot of Angular skills. The application was realized in collaboration with a team of ergonomists who provided us with ",
                "ux": "UX (user experience)",
                "and": " and ",
                "ui": "UI (user interface)",
                "mock-ups": " mock-ups studied with the client. Thanks to this team, we have an aesthetic and ergonomic site, to which we must add fluidity and performance thanks to our developments. One does not go without the other, and if we did not have this team of experts at our side, the site would certainly be functional and efficient, but not pleasant for the user, who would not see any difference with the old application on heavy client. I appreciate having to try to understand the needs of the customer and put myself in the users' shoes to give them the best possible experience. ",
                "e-monthly": "On the eMonthly project, I was also able to try the Angular project ",
                "architecture": "architecture",
                "experience": " thanks to the experience gained on my other Angular projects. I developed an Angular application template that can be reused for all new applications, with eMonthly at the top of the list. Thanks to this template, developers gain in efficiency and improve the industrialization of the process. It also provides guidelines for inexperienced Angular developers to avoid dispersal within the project architecture."
            }
        },
        "notions-of-architecture": {
            "title": "Notions of architecture",
            "subtitle": "This is the notions of architecture subtitle",
            "card-subtitle": "Angular, .NET",
            "card-content": "Through my projects, I was able to understand the architecture of a solution and participate"
        }
    },
    "human-skills": {
        "title": "Human skills",
        "subtitle": "My principal human skills",
        "autonomy": {
            "title": "Autonomy",
            "subtitle": "A developer needs to be able to work on his own",
            "card-subtitle": "Angular, .NET",
            "card-content": "I am able to work on my own, while still having a good team spirit",
            "definition": {
                "title": "What is autonomy?",
                "what": "Basically, ",
                "autonomy": "autonomy",
                "ability": " is the ability to act by myself in a specific environment. It doesn't mean working alone but working with other people being granted some freedom. I can do my tasks the way I like as far as it respects the perimeter given to me."
            },
            "it-company": {
                "title": "How does autonomy transcript into an IT company?",
                "employee": "The employee is given a work and hopefully knows how to achieve it. If he doesn't, he tries to figure out by himself using forums or tutorials on the Internet. If, despite searching and trying by himself, he is not able to achieve the work, he will report it to his manager.",
                "however": "However, there are obvious nuances. The employee must not stay stuck on an issue for an excessive amount of time without reporting it. He must be able to feel when he needs help. Yet he must search and try by himself before asking to his mates, else he will never make progress. In a sector in ",
                "evolution": "constant evolution",
                "binary": ", it is primary to constantly stay up-to-date. Also, autonomy is not a binary skill. There aren't autonomous or not autonomous people. Everybody is autonomous (at different degrees) because autonomy is something people work on."
            },
            "me": {
                "title": "Autonomy is one of my qualities",
                "vision": "I am used to work autonomously in a team thanks to my work experience at Capgemini Securitas Vision project (cf. ",
                "web-agent": "WebAgent",
                "and": " and ",
                "vision-safety": "VisionSafety",
                "internship": " apps). I entered the project during my six months internship. I joined a large project with several user applications and some complex functional aspects. However, I began correcting some issues on the main application from the first week only. Not only it allowed me to understand the software better, it also depicted my autonomy and my adaptability in a new environment. In this company, ",
                "feedbacks": "feedbacks",
                "colleagues": " to colleagues are anchored in our work and my autonomy is one of the main qualities highlighted on my profile. It was also noticed during the ",
                "poc": "",
                "call-center": "Call center",
                "poc-bis": " PoC (proof of concept)",
                "responsabilities": " which in my team and I had to take our responsabilities given the bad project follow-up."
            }
        },
        "creativity": {
            "title": "Creativity",
            "subtitle": "Creativity allows us to bring proper solutions",
            "card-subtitle": "Angular, .NET",
            "card-content": "I have a creative spirit, which allows me to innovate regularly",
            "definition": {
                "title": "What is creativity?",
                "the": "",
                "creativity": "Creativity",
                "ability": ". The ability of the mind to create something new from a given context. It is a skill that applies to numerous domains and that can take different shapes. In a professional project, creativity can result in the ability to ",
                "client-needs": "meet the needs of the client",
                "proposal": " using more appropriate means than the ones he thought of. In that way, creativity can join and add to strength of proposal."
            },
            "necessary": {
                "title": "Creativity is necessary",
                "any-project": "Any project needs a part of creativity. A team must have among its members at least one creative even though two would bring a debate and a thought leading to a higher quality solution. Creativity allows us to imagine ",
                "answers": "different and more appropriate answers",
                "requirements": " to the customer requirements than the usual ones. It is this creativity that a team will be able to demonstrate that will differentiate it from other technically equivalent teams to the client.",
                "develop": "Creativity is an innate quality, but not only. It is a skill that is developed over time and increases with experience. Everything that we discover, read, learn, comes unconsciously to fuel our creativity. The creative one must also be curious to usually renew the sources from which he draws for his creations."
            },
            "innovation": {
                "title": "Bring innovative solutions to the client",
                "creative": "I consider myself as a creative person. For example, during my ",
                "vision-safety": "VisionSafety",
                "sms-alerts": " project, I had to make a solution allowing the client to easily set in the mobile application the phone number to send an SMS alert to. This app being intended for all European countries where Securitas is implanted, I have to make a general solution for all countries. Some countries have several phone numbers, some have only one and some do not have any (the alerts are sent to a neighbouring country).",
                "suggested": "I suggested to the client to create a list containing all the phone numbers associated to their country. The countries having multiple phonen numbers will see them ordered by priority. Thus, the alerts will be sent to the phone number linked to the user country (and to the most prioritary one if the country has more than one phone number). I also created an interface so the administrators can directly set in the application which phone number to use (in order to use a less prioritary number or the one of another country in case no number is assigned to the user location). The client approved this solution allowing him to avoid deploying a different configuration for each country, ",
                "reducing": "reducing the exploitation costs",
                "application": " of the application."
            },
            "other-domains": {
                "title": "Creativity in others domains",
                "various-forms": "As said above, cretivity can take different forms. It can also take on an artistic form. Although I am not an artist, ",
                "new-stuff": "I like to imagine and create new stuff",
                "pokemon": ". It especially serves me in my Pokémon fangame personal project, in which I create and add fake Pokémon, new creatures that could have a place in Nintendo's licence. These creations are made according to the \"pixel art\" style, allowing novices like me to create as they wish without having great drawing skills. For example, I created the Pokémon below, which have been complimented by oither experimented members of the Pokémon fangames online community."
            },
            "pokemon": {
                "scaracorn": "Scaracorn",
                "scaracorn-bis": ", ",
                "beetleaf": "Beetleaf",
                "beetleaf-bis": " and ",
                "oakleoptera": "Oakleoptera",
                "created": ", three Pokémon that I created"
            }
        },
        "knowledge-sharing": {
            "title": "Knowledge sharing",
            "subtitle": "Transmit my knowledge to other people",
            "card-subtitle": "Angular, .NET",
            "card-content": "I like to share my knowledge with others, whether functional or technical",
            "importance": {
                "title": "The importance of knowledge sharing",
                "important": "In a team, it is important that everyone learns from others. This is especially true for somebody who just joined it. This person must upgrade to the technical and functional knowledge of the project in order to work efficiently on it. It is the responsibility of the most experienced members to support these new members so that they are up and running as quickly as possible."
            },
            "serve": {
                "title": "Serve my teammates",
                "available": "I am always very available for my team, whether they need information or a specific explanation of a project element. For example, during the redesign of the ",
                "web-agent": "WebAgent",
                "application": " application, we welcomed a third developer. It was my job to evaluate his mastery of ",
                "angular": "Angular",
                "technology": " technology and to show him the tools and methods we used on the project. I also introduced him to the functional aspects of the applications, explaining the work of security agents, their needs and expectations."
            },
            "accompany": {
                "title": "Accompany developers in difficulty",
                "skill": "I was also able to use this skill in the ",
                "call-center": "Call Center",
                "project": " project. A fourth member joined our team during the ",
                "poc": "PoC",
                "retraining": ". He was a retraining person who had difficulty developing. Thus, I accompanied him in his work until I left the project a few weeks later.",
                "task": "The task was not easy, I had to teach him all the concepts of ",
                "angular": "Angular",
                "explain": ", explain the use of ",
                "git": "Git",
                "balance": ", read his code... The most difficult was to balance my interventions. I wanted to let him work a maximum in autonomy so that it progresses faster and that it gains confidence, without abandoning him. I had to help him when he needed it to ensure the quality and timeliness of the application, but I myself did not have to waste too much time on my own tasks. For this, I asked him to regroup his questions and remarks to the maximum so that we made a daily update on his difficulties, except in case of complete blocking where he could come to see me. Finally, after nearly a month, he became completely autonomous on simple tasks and was able to perform more complex ones by asking for help if needed from other members of the team."
            }
        },
        "languages": {
            "title": "Languages",
            "subtitle": "Younger, I wanted to become an interpreter",
            "card-subtitle": "Angular, .NET",
            "card-content": "I love languages, and I speak English fluently",
            "passion": {
                "title": "My passion for languages",
                "child": "Since I was a child, I have been passionate about languages. I practiced very little English during my primary school, so I really started to learn languages from middle school where, in addition to compulsory ",
                "english": "English",
                "chose": ", I chose the ",
                "spanish": "Spanish",
                "option": " option of my establishment from the 6th grade. I continued with the ",
                "latin": "Latin",
                "middle-school": " option in 7th grade and I chose the European section in 8th grade to practice more English. During this middle school period, when I was asked what I wanted to do later, I said \"interpreter\".",
                "high-school": "I pursued English (with European section), Spanish and Latin lessons during my high school, after which I joined the IN'TECH school where I continued to practice English in courses focused on practice and speaking. In this school, I passed the ",
                "toeic": "TOEIC",
                "score": " in my first semester, to which I obtained a score of 865 points out of 990. I passed this test again at the end of my studies, of which I expect results to evaluate my progress during these five years in school and in business. During my studies at IN'TECH, I did not have the opportunity to pursue Spanish and Latin. On the other hand, I was able to practice Spanish during a stay in the Valencia area and I realized that the ease of communication came back after two to three days in the environment. As for Latin, continuing to study it would not have brought me much in my field, however it continues to be useful today in the understanding of the Romance languages and especially in the spelling of the French language."
            },
            "today": {
                "title": "Languages today",
                "english": "Although Spanish has served me very little in recent years, apart from a stay in Spain, English is everywhere in my life. On the one hand, of course, as a developer, English is my language of choice for coding, but also for communicating with other developers in the global community. Even in my everyday life, I use English permanently, mainly on the Internet. Even on Netflix or Prime Video, I watch English-language series and films in the original language not subtitled. I regularly stay with my sister living in Dublin, Ireland. Thus, I know how to accustom myself to sometimes complex to understand accents. And, to top it off, I made this portfolio both in French and English.",
                "future": "In the future, I intend to continue to improve my level of English to move to a truly bilingual status. I intend to live in ",
                "new-zealand": "New Zealand",
                "ten-years": " in the next ten years, first for six months, then, depending on my desire to stay, one year, two years, etc. I will extend my life there as long as I enjoy it. If I have the opportunity (and faith) to learn new languages in the future, I would like to learn Italian, which I personally consider to be the most beautiful language in the world. I would also like to have some notions of Japanese and, why not, to be interested in Russian."
            }
        },
        "team-leading": {
            "title": "Team leading",
            "subtitle": "An introduction to team leading",
            "card-subtitle": "Angular, .NET",
            "card-content": "I have got the opportunity to experiment team leading during my apprenticeship",
            "arrival": {
                "title": "My arrival in a PoC",
                "october": "Last October, I join a ",
                "poc": "PoC (proof of concept)",
                "named": " named ",
                "call-center": "Call center",
                "team": ". The team is made of three developers including me. The project is directed by a project manager who is already managing other projects and required by a commercial from my company to sell this PoC to customers.",
                "goal": "The goal of the project is to make a portal for a call center intended for the energy distributors. The portal is divided in two parts: on one side, the subscription to a new contract by phone and on the other side, the consulting of an existing customer’s data for after sales service."
            },
            "lead": {
                "title": "Taking the lead",
                "visibility": "We have little visibility and instructions from him, and our project manager is quite busy with his ancillary projects. In order to improve the ",
                "productivity": "productivity",
                "dialogue": " of the team and the dialogue with our interlocutors, and assuming I am the most experienced member, I decide to take the lead of the team, with the approval of the other developers.",
                "learn": "I learn to organize the tasks of the team members, ask for visibility on the client requests and plan and host meetings with all interested parties through the project. The ",
                "communication": "communication",
                "difficult": " with the other parties of the team was the most difficult part. Since it is a PoC and therefore a project without immediate value, it is not a priority to the other interlocutors.",
                "functionalities": "On one side, the commercial who ordered the project gives us instructions in order to present the functionalities he wants to his customers. Only, all these functionalities are not implementable because the project is depending on an API developed by another team. Given that our project manager also has other projects going on, I must take care of making the link between the commercial and the person in charge of the API team. Through this initiative, specific decisions are made on the future of the project in the short and medium term. I leave the project a little after, once the first iteration is finished and ready to be presented to the client.",
                "experience": "This experience allowed me to try the role of team leader in a serene way since the stakes were less important than in a billed project. I learned to establish communication among the team members and beyond, and I realized that I knew how to show a good ",
                "organization": "organization",
                "organization-bis": "."
            }
        }
    },
    "redirects": {
        "linked-projects": {
            "title": "Linked projects",
            "call-center": "Call center",
            "e-monthly": "eMonthly",
            "galt": "Galt",
            "vision-safety": "VisionSafety",
            "web-agent": "WebAgent"
        },
        "linked-technical-skills": {
            "title": "Linked technical skills",
            "android": "Android",
            "dot-net-core-web-api": ".NET Core Web API",
            "financial-assessments": "Financial assessments",
            "front-end": "Front end",
            "notions-of-architecture": "Notions of architecture"
        },
        "linked-human-skills": {
            "title": "Linked human skills",
            "autonomy": "Autonomy",
            "creativity": "Creativity",
            "knowledge-sharing": "Knowledge sharing",
            "languages": "Languages",
            "team-leading": "Team leading"
        }
    },
    "career": {
        "title": "Career",
        "subtitle": "Professional experience and education",
        "click": "Click on an experience to display the detail",
        "cdi": {
            "button": "Capgemini regular employment",
            "title": "Angular consultant at Capgemini",
            "duration": "from September 2019",
            "message": "Following my apprenticeship and my internship at Capgemini, I continue to work on the Securitas project from September 2019 as an Angular consultant."
        },
        "alternance": {
            "button": "Capgemini apprenticeship",
            "title": "Software apprentice developper at Capgemini",
            "duration": "September 2017 - September 2019 • 2 years",
            "message": "During my five years curriculum within IN'TECH, I've been an apprentice during two years at Capgemini following my internship. I mainly developped my technical and soft skills."
        },
        "stage-cap": {
            "button": "Capgemini internship",
            "title": "Software trainee developper at Capgemini",
            "duration": "March 2017 - September 2017 • 6 months",
            "message": "After two and a half years at IN'TECH, I joined Capgemini as part of a six months internship to discover and learn the software developper job."
        },
        "stage-asp": {
            "button": "ASP internship",
            "title": "Trainee developper at ASP Nettoyage",
            "duration": "February 2015 • 1 month",
            "message": "During my first year at IN'TECH, I had an internship in order to discover the world of business during one month. I helped the small cleaning company ASP Nettoyage to digitalize their quality controls using tablets instead of paper forms. Being alone, I took advantage of my autonomy to build a functional solution in a month using online Google Forms and Javascript and VBA scripts."
        },
        "intech": {
            "button": "Software engineering expert diploma",
            "title": "Software engineering student",
            "duration": "September 2014 - September 2019 • 5 years",
            "message": "Following by science baccalaureate, I wanted to join IN'TECH, a computer science school known for its different pedagogy focused on practice and group work. During my curriculum, I have been able to make several business-like projects, inluding Galt. After five years, I validated the graduation of software engineering expert, certified by the french RNCP committee as a level 1 diploma (Master)."
        },
        "bac": {
            "button": "Science baccalaureate",
            "title": "Science baccalaureate graduate",
            "duration": "2014",
            "message": "At the end of my high school, I graduated from a scientific baccalaureate (computer and digital science option) with honors."
        }
    },
    "hobbies": {

    },
    "about": {
        "about": "About",
        "my-portfolio": "my portfolio",
        "copyright": "Copyright © 2019 Antonin CHARRIER - All rights reserved",
        "developped": "Developped with ",
        "angular": "Angular 7",
        "angular-website": "Angular website",
        "using": " using ",
        "material": "Material Design",
        "material-website": "Angular Material website",
        "translations": "Translations managed with ",
        "ngx-translate": "NGX-Translate",
        "ngx-translate-website": "NGX-Translate website",
        "library": " library",
        "resume": "Resume displayed with ",
        "ng2-pdf-viewer": "Ng2 PDF Viewer",
        "ng2-pdf-viewer-website": "Ng2 PDF Viewer npm page",
        "icons": "Icons made by ",
        "simpleicon-website": "SimpleIcon Flaticon page",
        "and": " and ",
        "freepik-website": "Freepik website",
        "from": " from ",
        "flaticon-website": "Flaticon website",
        "licensed": " are licensed by ",
        "cc-3-0-website": "Creative Commons BY 3.0 page",
        "illustrations": "The illustrations of the cards were made by artist ",
        "hassan-website": "Mohammed Hassan Pixabay page",
        "images": ". Other images are royalty free.",
        "code": "All the source code of my portfolio is available on ",
        "github": "GitHub",
        "github-website": "My GitHub page"
    },
    "resume": {
        "title": "Resume",
        "download": "Download",
        "error": "Sorry, my resume didn't load correctly :(",
        "close": "Close"
    },
    "contact-info": {
        "title": "Contact informations",
        "email": "charrier.antonin@yahoo.fr",
        "phone-number": "(+33) 770.978.302",
        "linkedin": "antonin-charrier",
        "birth-date": "03-10-1997 ",
        "years-old": " years old",
        "city": "Issy-Les-Moulineaux (Paris, France)",
        "send-email": "Send an email",
        "phone-call": "Call",
        "ask-connection": "Ask for a connection"
    }
}