{
    "sidenav": {
        "profile": {
            "name": "Antonin CHARRIER",
            "job": "Consultant Angular",
            "email": "Envoyer un mail",
            "linkedin": "Visiter ma page LinkedIn",
            "github": "Visiter ma page GitHub",
            "resume": "Voir mon CV"
        },
        "home": "Accueil",
        "projects": "Projets",
        "call-center": "Call center",
        "e-monthly": "eMonthly",
        "galt": "Galt",
        "vision-safety": "VisionSafety",
        "web-agent": "WebAgent",
        "technical-skills": "Compétences techniques",
        "android": "Android",
        "dot-net-core-web-api": "API Web .NET Core",
        "financial-assessments": "Chiffrages financiers",
        "front-end": "Front end",
        "notions-of-architecture": "Notions d'architecture",
        "human-skills": "Compétences humaines",
        "autonomy": "Autonomie",
        "creativity": "Créativité",
        "knowledge-sharing": "Partage de connaissances",
        "languages": "Langues",
        "team-leading": "Gestion d'équipe",
        "hobbies": "Loisirs",
        "language": "Changer de langue",
        "about": "À propos"
    },
    "wip": {
        "work-in-progress": "Travail en cours"
    },
    "projects": {
        "e-monthly": {
            "title": "eMonthly",
            "subtitle": "Architecturer un projet Angular",
            "template": {
                "title": "Construction d'un template Angular",
                "after-working": "Après avoir travaillé sur plusieurs ",
                "angular-projects": "projets Angular",
                "project-manager": ", mon chef de projet me propose de mettre en place le squelette d'une solution Angular qui servirait de template à toutes les nouvelles applications Angular de mon centre de services. Le template doit dans un premier temps être utilisé pour une application web pour le compte de l'entreprise d'aéronautique Safran. Cette apoplication, appelée eMonthly, aide les employés de Safran à rentrer et consulter les notes d'évaluation de la qualité des services proposés à leurs clients."
            },
            "architecture": {
                "title": "Intégration de puissants frameworks",
                "one-week":  " Je ne travaille qu'une semaine sur ce projet. Durant cette semaine, je créée le projet Angular, organise ",
                "architecture": "l'architecture",
                "by-creating": " de la solution en créant ",
                "services": "des services, des composants, des guards",
                "references": ", etc. J'ajoute des références vers des bibliothèques que notre centre a intérêt à utiliser d'après les demandes récurrents des clients. J'ajoute notamment ",
                "angular-material": "Angular Material",
                "website": " pour effectuer rapidement et facilement un design de site soigné (en particulier pour les PoC) et ",
                "kendo": "Kendo for Angular",
                "grid": " afin de pouvoir utiliser des systèmes de grille, très demandés par les clients.",
                "specificities": "Une fois le template de projet opérationnel, je travaille sur les spécificités de l'application pour Safran. Je constate l'intérêt d'avoir une solution toute prête, modulable et réutilisable dans le futur. Ensuite, j'intègre très facilement quelques écrans demandés dans les spécifications grâce à Angular Material et Kendo déjà configurés."
            }, 
            "future": {
                "title": "Continuer à améliorer le template",
                "expect" : "Je compte travailler de nouveau sur le template de projet Angular afin de l'améliorer en fonction des besoins des futurs clients. Je souhaite également le rendre encore plus accessible et modulable pour les futurs dévéloppeurs qui seront amenés à l'utiliser, même pour les néophytes en Angular, pour les encourager à utiliser des bonnes pratiques de conception dès le début."
            }
        }
    },
    "human-skills": {
        "autonomy": {
            "title": "Autonomie",
            "subtitle": "Un développeur doit être capable de travailler par lui-même",
            "definition": {
                "title": "Qu'est-ce que l'autonomie ?",
                "what": "Fondalementalement, ",
                "autonomy": "l'autonomie",
                "ability": " est la capacité d'agir par soi-même dans un environnement spécifique. Cela ne signifie pas travailler seul mais travailler avec d'autres personnes en ayant certaines libertés. Je peux faire mes tâches comme je le souhaite tant que cela respecte le périmètre qui m'a été donné."
            },
            "it-company": {
                "title": "Comment l'autonomie se transcrit dans une ESN ?",
                "employee": "L'employé se voit donné un travail et potentiellement sait comment le faire. S'il ne sait pas, il essaye de comprendre par lui-même en utilisant des forums ou des tutoriels sur internet. Si, après avoir cherché et essayé par lui-même, il n'est pas capable de faire le travail, il le signale à son manager.",
                "however": " Cependant, il existe des nuances évidents. L'employé ne doit pas rester bloqué sur un problème trop longtemps sans le signaler. Il doit être capable de savoir lorsque il a besoin d'aide. Cependant il doit chercher et essayer par lui-même avant de demander à ses collègues, sinon il ne progressera jamais. Dans un secteur en ",
                "evolution": "constante évolution",
                "binary": ", il est primordial d'être constamment à jour. De plus, l'autonomie n'est pas une compétence binaire. Il n'y a pas de personnes autonomes ou pas autonomes. Tout le monde est autonome (à des degrés différents) car l'autonomie est quelque chose sur laquelle les gens travaillent."
            },
            "me": {
                "title": "L'autonomie est l'une de mes qualités.",
                "vision": "Je suis habitué à travailler en autonomie dans mon équipe grâce à mon expérience dans le projet Vision de Securitas chez Capgemini (cf. les applications",
                "web-agent": "WebAgent",
                "and": " et ",
                "vision-safety": "VisionSafety",
                "internship": "). Je suis entré dans le projet durant mon stage de six mois. J'ai rejoint un gros projet avec plusieurs applications utilisateur et certains aspects fonctionnels complexes. Pourtant, j'ai commencé à corriger des anomalies sur l'application principale dès la première semaine seulement. Non seulement cela m'a permis de mieux comprendre le logiciel,the software better, cela a aussé démontré mon autonomie et mon adaptabilité au sein d'un nouvel environnement. Dans cette entreprise, ",
                "feedbacks": "les feedbacks",
                "colleagues": " aux collègues sont ancrés dans notre travail et l'autonomie est l'une des principales qualités mises en avant sur mon profil."
            }
        }
    },
    "redirects": {
        "linked-projects": {
            "title": "Projets liés",
            "call-center": "Call center",
            "e-monthly": "eMonthly",
            "galt": "Galt",
            "vision-safety": "VisionSafety",
            "web-agent": "WebAgent"
        },
        "linked-technical-skills": {
            "title": "Compétences techniques liées",
            "android": "Android",
            "dot-net-core-web-api": "API Web .NET Core",
            "financial-assessments": "Chiffrages financiers",
            "front-end": "Front end",
            "notions-of-architecture": "Notions d'architecture"
        },
        "linked-human-skills": {
            "title": "Compétences humaines liées",
            "autonomy": "Autonomie",
            "creativity": "Créativité",
            "knowledge-sharing": "Partage de connaissances",
            "languages": "Langues",
            "team-leading": "Gestion d'équipe"
        }
    },
    "hobbies": {

    },
    "about": {
        "icons": "Les icônes faites par",
        "from": "depuis",
        "licensed": "sont sous licence"
    },
    "resume": {
        "title": "CV",
        "download": "Télécharger",
        "error": "Désolé, mon CV ne s'est pas chargé correctement :(",
        "close": "Fermer"
    }
}