Repository: antonin-charrier/Portfolio
Catalog: src/locale/messages.*.xlf
Languages: fr

# linkedProjectsTitle
source: Linked projects
fr: Projets liés

# linkedTechnicalSkillsTitle
source: Linked technical skills
fr: Compétences techniques liées

# linkedProjectsDotNetCoreWebApi
source: <a>.NET Core Web API</a>
fr: <a>API Web .NET Core</a>

# linkedProjectsFinancialAssessments
source: <a>Financial assessments</a>
fr: <a>Chiffrages financiers</a>

# linkedProjectsNotionsOfArchitecture
source: <a>Notions of architecture</a>
fr: <a>Notions d'architecture</a>

# linkedHumanSkillsTitle
source: Linked human skills
fr: Compétences humaines liées

# linkedProjectsAutonomy
source: <a>Autonomy</a>
fr: <a>Autonomie</a>

# linkedProjectsCreativity
source: <a>Creativity</a>
fr: <a>Créativité</a>

# linkedProjectsKnowledgeSharing
source: <a>Knowledge sharing</a>
fr: <a>Partage de connaissances</a>

# linkedProjectsLanguages
source: <a>Languages</a>
fr: <a>Langues</a>

# linkedProjectsTeamLeading
source: <a>Team leading</a>
fr: <a>Gestion d'équipe</a>

# homeLink
source: Home
fr: Accueil

# projectsLink
source: Projects
fr: Projets

# technicalSkillsLink
source: Technical skills
fr: Compétences techniques

# dotNetCoreWebApiLink
source: .NET Core Web API
fr: API Web .NET Core

# financialAssessmentsLink
source: Financial assessments
fr: Chiffrages financiers

# notionsOfArchitectureLink
source: Notions of architecture
fr: Notions d'architecture

# humanSkillsLink
source: Human skills
fr: Compétences humaines

# autonomyLink
source: Autonomy
fr: Autonomie

# creativityLink
source: Creativity
fr: Créativité

# knowledgeSharingLink
source: Knowledge sharing
fr: Partage de connaissances

# languagesLink
source: Languages
fr: Langues

# teamLeadingLink
source: Team leading
fr: Gestion d'équipe

# hobbiesLink
source: Hobbies
fr: Loisirs

# wipLink
source: Work in progress
fr: Travail en cours

# eMonthlySubtitle
source: Architecting an Angular project
fr: Architecturer un project Angular

# eMonthlyParagraph
source: After working on several <a>Angular projects</a> , my project manager suggests me to set up the skeletton of an Angular solution that would be used as a template for every new Angular app in my services centre. The template first needs to be used for a web app for Safran aeronautics company. This app, called eMonthly, helps Safran employees to input and to consult the evualuation marks for the quality of the services offered to their customers. <br/> <br/> I work only one week on this project. During this week, I create the Angular projet , organize <a>the architecture</a> of the solution by creating <b>services, components, guards</b>, etc. I add references to libraries that our centre has interest in using based on recurent feedback from clients. I especially add <b>Angular Material</b> to make rapidly and efficiently a neat website design (in particular for PoCs) and <b>Kendo for Angular</b> to be able to use grid systems that are a usual request from clients. <br/> <br/> Once this template project is operational, I work on the specificities of the application for Safran. I note the interest of a built-in solution which is ready, modular and reusable in the future. Then I easily integrate some screens asked in the specifications using Angular Material and Kendo already configured. <br/> <br/> I expect to work again on the Angular project template to improve it based on the needs of the future clients. I also want to make it more accessible and modular for the future developers that will use it, even if they are new to Angular, to encourage them to use good conception practices from the beginning.
fr: Après avoir travaillé sur plusieurs <a>projets Angular</a> , mon chef de projet me propose de mettre en place le squelette d'une solution Angular qui servirait de template à toutes les nouvelles applications Angular de mon centre de services. Le template doit dans un premier temps être utilisé pour une application web pour le compte de l'entreprise d'aéronautique Safran. Cette apoplication, appelée eMonthly, aide les employés de Safran à rentrer et consulter les notes d'évaluation de la qualité des services proposés à leurs clients. <br/> <br/> Je ne travaille qu'une semaine sur ce projet. Durant cette semaine, je créée le projet Angular , organise <a>l'architecture</a> de la solution en créant <b>des services, des composants, des guards</b>, etc. J'ajoute des références vers des bibliothèques que notre centre a intérêt à utiliser d'après les demandes récurrents des clients. J'ajoute notamment <b>Angular Material</b> pour effectuer rapidement et facilement un design de site soigné (en particulier pour les PoC) et <b>Kendo for Angular</b> afin de pouvoir utiliser des systèmes de grille, très demandés par les clients. <br/> <br/> Une fois le template de projet opérationnel, je travaille sur les spécificités de l'application pour Safran. Je constate l'intérêt d'avoir une solution toute prête, modulable et réutilisable dans le futur. Ensuite, j'intègre très facilement quelques écrans demandés dans les spécifications grâce à Angular Material et Kendo déjà configurés. <br/> <br/> Je compte travailler de nouveau sur le template de projet Angular afin de l'améliorer en fonction des besoins des futurs clients. je souhaite également le rendre encore plus accessible et modulable pour les futurs dévéloppeurs qui seront amenés à l'utiliser, même pour les néophytes en Angular, pour les encourager à utiliser des bonnes pratiques de conception dès le début.

# autonomyTitle
source: Autonomy
fr: Autonomie

# autonomysubtitle
source: <i>Because a developer has to be able to work on hos own</i>
fr: <i>Car un développeur doit être capable de travailler par lui-même</i>

# autonomyParagraph
source: What is autonomy ? Basically, <b>autonomy</b> is the ability to act by ùyself in a specific environment. It doesn't mean working alone but working with other people being granted some freedom. I can do my tasks the way I like as far as it respects the perimeter given to me. <br/> <br/> How does autonomy transcript into an IT company? The employee is given a work and hopefully knows how to achieve it. If he doesn't, he tries to figure out by himself using forums or tutorials on the Internet. If, despite searching and trying by himself, he is not able to achieve the work, he will report it to his manager. <br/> <br/> However, there are obvious nuances. The employee must not stay stuck on an issue for an excessive amount of time without reporting it. He must be able to feel when he needs help. Yet he must search and try by himself before asking to his mates, either way he will never make progress. In a sector in <b>constant evolution</b>, it is primary to constantly stay up-to-date. Also, autonomy is not a binary skill. There aren't autonomous or not autonomous people. Everybody is autonomous (at different degrees) because autonomy is something people work on. <br/> <br/> Autonomy is one of my qualities. I am used to work autonomously in a team thanks to my work experience at Capgemini Securitas Vsion projet (cf. <a>WevAgent</a> and <a>VisionSafety</a> apps). I entered the project during my six months internship. I joined a big project with several user applications and some complex functional aspects. However, I began correcting some issues on the main application from the first week only. Not only it allowed me to understand the software better, it also depicted my autonomy and my adaptability in a new environment. In this company, <b>feedbacks</b> to colleagues are anchored in our work and my autonomy is one of the main qualities highlighted on my profile.
fr: Qu'est-ce que l'autonomie ? Fondalementalement, <b>l'autonomie</b> est la capacité d'agir par soi-même dans un environnement spécifique. Cela ne signifie pas travailler seul mais travailler avec d'autres personnes en ayant certaines libertés. Je peux faire mes tâches comme je le souhaite tant que cela respecte le périmètre qui m'a été donné. <br/> <br/> Comment l'autonomie se transcrit dans une ESN ? L'employé se voit donné un travail et potentiellement sait comment le faire. S'il ne sait pas, il essaye de comprendre par lui-même en utilisant des forums ou des tutoriels sur internet. Si, après avoir cherché et essayé par lui-même, il n'est pas capable de faire le travail, il le signale à son manager. <br/> <br/> Cependant, il existe des nuances évidents. L'employé ne doit pas rester bloqué sur un problème trop longtemps sans le signaler. Il doit être capable de savoir lorsque il a besoin d'aide. Cependant il doit chercher et essayer par lui-même avant de demander à ses collègues, sinon il ne progressera jamais. Dans un secteur en <b>constante évolution</b>, il est primordial d'être constamment à jour. De plus, l'autonomie n'est pas une compétence binaire. Il n'y a pas de personnes autonomes ou pas autonomes. Tout le monde est autonome (à des degrés différents) car l'autonomie est quelque chose sur laquelle les gens travaillent. <br/> <br/> L'autonomie est l'une de mes qualités. Je suis habitué à travailler en autonomie dans mon équipe grâce à mon expérience dans le projet Vision de Securitas chez Capgemini (cf. les applications <a>WebAgent</a> et <a>VisionSafety</a>). Je suis entré dans le projet durant mon stage de six mois. J'ai rejoint un gros projet avec plusieurs applications utilisateur et certains aspects fonctionnels complexes. Pourtant, j'ai commencé à corriger des anomalies sur l'application principale dès la première semaine seulement. Non seulement cela m'a permis de mieux comprendre le logiciel,the software better, cela a aussé démontré mon autonomie et mon adaptabilité au sein d'un nouvel environnement. Dans cette entreprise, <b>les feedbacks</b> aux collègues sont ancrés dans notre travail et l'autonomie est l'une des principales qualités mises en avant sur mon profil.
